"CIAdditionCompositing" = "Voegt kleurcomponenten toe om de helderheid te vergroten. Dit filter wordt meestal gebruikt om gedeelten uit te lichten en het effect van lichtinval in de lens toe te voegen.";"CIAffineClamp" = "Dit filter voert een affiene transformatie uit op een bronafbeelding en knijpt vervolgens de pixels aan de rand van de getransformeerde afbeelding samen zodat ze zich naar buiten toe uitstrekken. Dit filter is vergelijkbaar met het CIAffine Transform-filter, maar produceert een afbeelding die zich oneindig uitstrekt. U kunt dit filter gebruiken als u een afbeelding wilt vervagen zonder de randen een wazige zwarte contour te geven.";"CIAffineTile" = "Dit filter past een affiene transformatie toe op een afbeelding en verdeelt de getransformeerde afbeelding in tegels.";"CIAffineTransform" = "Dit filter past een affiene transformatie toe op een afbeelding. U kunt de invoerafbeelding vergroten, verkleinen, omzetten of roteren. U kunt ook een combinatie van deze bewerkingen toepassen.";"CIBarsSwipeTransition" = "Laat een afbeelding overgaan in een andere door rechthoekige gedeelten van de afbeelding op de voorgrond weg te vegen zodat de doelafbeelding zichtbaar wordt.";"CIBlendWithMask" = "Gebruikt waarden van een grijstintmasker om te interpoleren tussen een afbeelding en de achtergrond. Wanneer een maskerwaarde 0,0 is, is het resultaat de achtergrond. Wanneer de maskerwaarde 1,0 is, is het resultaat de afbeelding.";"CIBloom" = "Vervaagt randen en voegt een aangename glans toe aan een afbeelding.";"CIBoxBlur" = "Maakt een afbeelding vager of scherper op basis van een vakvormige convolutiekernel.";"CIBumpDistortion" = "Creëert een holle of bolle hobbel die begint op een opgegeven punt in de afbeelding.";"CIBumpDistortionLinear" = "Creëert een hobbel die begint bij een lineair gedeelte van de afbeelding.";"CICMYKHalftone" = "Creëert een halftintversie in kleur van de bronafbeelding op basis van de inkten cyaan, magenta, geel en zwart op een witte pagina.";"CICheckerboardGenerator" = "Genereert een dambordpatroon. U kunt de grootte en de kleuren instellen en opgeven hoe scherp het patroon wordt.";"CICircleSplashDistortion" = "Vervormt de pixels vanaf de omtrek van een cirkel in uitwaartse richting.";"CICircularScreen" = "Bootst een halftintraster met een cirkelpatroon na.";"CICircularWrap" = "Wikkelt een afbeelding rond een doorzichtige cirkel. De vervorming van de afbeelding neemt toe naarmate de afstand tot het middelpunt van de cirkel toeneemt.";"CIColorControls" = "Past de waarden voor verzadiging, helderheid en contrast aan.";"CIColorCube" = "Gebruikt een driedimensionale kleurtabel om pixels van de bronafbeelding te transformeren. De kleurtabel moet zijn samengesteld uit drijvende-komma-RGBA-cellen die vooraf vermenigvuldigd alfa gebruiken. De kolommen en rijen met gegevens worden geïndexeerd door respectievelijk rood en groen. Elk gegevensvlak wordt gevolgd door het eerstvolgende hogere vlak in de gegevens, waarbij vlakken worden geïndexeerd door blauw.";"CIColorInvert" = "Keert de kleuren in een afbeelding om.";"CIColorMap" = "Voert een niet-lineaire transformatie van bronkleurwaarden uit op basis van koppelingswaarden uit een tabel.";"CIColorMatrix" = "Vermenigvuldigt bronkleurwaarden en voegt een afwijkingsfactor toe aan elke kleurcomponent.";"CIColorMonochrome" = "Wijzigt de koppeling van kleuren, zodat ze binnen de tinten van één kleur vallen.";"CIColorPosterize" = "Past de koppeling van rode, groene en blauwe kleurcomponenten aan het aantal helderheidswaarden aan die u opgeeft voor elke kleurcomponent. Dit filter effent kleuren zodat ze eruitzien als de kleuren van een gezeefdrukte poster.";"CIComicEffect" = "Bootst de tekenstijl van stripboeken na door randen een contour te geven en een halftintkleureffect toe te passen.";"CIConstantColorGenerator" = "Genereert een effen kleur. Doorgaans gebruikt u de uitvoer van dit filter als de invoer voor een ander filter.";"CICopyMachineTransition" = "Laat een afbeelding overgaan in een andere door het effect van een kopieerapparaat na te bootsen.";"CICrop" = "Past bijsnijden toe op de afbeelding. De grootte en vorm van de bijgesneden afbeelding worden bepaald door de rechthoek die u opgeeft.";"CICrystallize" = "Creëert veelhoekige kleurenblokken door aggregatie van de bronpixelkleurwaarden.";"CIDiscBlur" = "Maakt een afbeelding vager of scherper op basis van een schijfvormige convolutiekernel.";"CIDisintegrateWithMaskTransition" = "Laat een afbeelding overgaan in een andere via de vorm die door het masker wordt gedefinieerd.";"CIDisplacementDistortion" = "Past de grijstintwaarden van de tweede afbeelding toe op de eerste afbeelding. De uitvoerafbeelding heeft een textuur die wordt bepaald door de grijstintwaarden.";"CIDissolveTransition" = "Laat een afbeelding overvloeien in een andere.";"CIDotScreen" = "Bootst het stippenpatroon van een halftintraster na.";"CIEdges" = "Vindt alle randen in een afbeelding en geeft ze in kleur weer.";"CIEdgeWork" = "Produceert een gestileerde zwartwitversie van een afbeelding die vergelijkbaar is met een houtsnede.";"CIEightfoldReflectedTile" = "Produceert een tegelafbeelding van een bronafbeelding door een achtvoudig weerspiegelde symmetrie toe te passen.";"CIExposureAdjust" = "Past de belichtingsinstelling voor een afbeelding aan op dezelfde manier als waarop u de belichting op een camera wijzigt wanneer u de f-stop wijzigt.";"CIFalseColor" = "Zet de luminantie uit volgens een kleurverloop met twee kleuren. Valse kleur wordt vaak gebruikt voor de verwerking van astronomische en andere wetenschappelijke gegevens, zoals ultraviolet- en röntgenafbeeldingen.";"CIFastBoxBlur" = "Maakt een afbeelding vager of scherper op basis van een vakvormige convolutiekernel.";"CIFastDiscBlur" = "Maakt een afbeelding vager of scherper op basis van een schijfvormige convolutiekernel.";"CIFlashTransition" = "Laat een afbeelding overgaan in een andere door een flits te creëren. De flits begint bij het punt dat u opgeeft en breidt zich vanaf een klein punt uit totdat het hele afbeeldingskader is gevuld met de flitskleur. Naarmate de kleur afzwakt, wordt de doelafbeelding meer en meer zichtbaar.";"CIFourfoldReflectedTile" = "Produceert een tegelafbeelding van een bronafbeelding door een viervoudig weerspiegelde symmetrie toe te passen.";"CIFourfoldRotatedTile" = "Produceert een tegelafbeelding van een bronafbeelding door de bron in stappen van 90 graden te draaien.";"CIFourfoldTranslatedTile" = "Produceert een tegelafbeelding van een bronafbeelding door vier conversiebewerkingen uit te voeren.";"CIGammaAdjust" = "Past de helderheid van de middentinten aan. Dit filter wordt meestal gebruikt om de niet-lineaire effecten van beeldschermen te compenseren. Door het gamma aan te passen, wordt de hellingshoek van de overgang tussen zwart en wit gewijzigd.";"CIGaussianBlur" = "Verspreidt bronpixels met een hoeveelheid die is opgegeven door een Gaussiaanse verdeling.";"CIGaussianGradient" = "Genereert een gradiënt die van een kleur naar een andere loopt via een Gaussiaanse verdeling.";"CIGlassDistortion" = "Vervormt een afbeelding door een glasachtige textuur toe te passen. De verhoogde delen van de uitvoerafbeelding zijn het resultaat van het toepassen van een textuurkoppeling.";"CIGlassLozenge" = "Creëert een capsulevormige lens en vervormt het deel van de afbeelding waarover de lens is geplaatst.";"CIGlideReflectedTile" = "Produceert een tegelafbeelding van een bronafbeelding door de afbeelding om te zetten en uit te smeren.";"CIGloom" = "Maakt de lichte gedeelten van een afbeelding fletser.";"CIHatchedScreen" = "Bootst het gearceerde patroon van een halftintraster na.";"CIHeightFieldFromMask" = "Produceert een continu driedimensionaal, \"loft\"-vormig hoogteveld van een grijstintmasker. De witwaarden van het masker bepalen welke pixels binnen het hoogteveld liggen, terwijl de zwartwaarden bepalen welke pixels erbuiten liggen. Het veld varieert vloeiend en doorlopend binnen het masker, waarbij aan de rand van het masker de waarde 0 wordt bereikt. U kunt dit filter gebruiken in combinatie met het CIShadedMaterial-filter om objecten met uiterst realistische schaduwwerking te produceren.";"CIHexagonalPixellate" = "Geeft een afbeelding weer als gekleurde zeshoeken waarvan de kleur een gemiddelde is van de pixels die worden vervangen.";"CIHoleDistortion" = "Creëert een cirkelvormig gebied dat de afbeeldingspixels naar buiten duwt, waarbij de pixels die zich het dichtst bij de cirkel bevinden het meest worden vervormd.";"CIHueAdjust" = "Wijzigt de algehele tint van de bronpixels.";"CIKaleidoscope" = "Produceert een caleidoscopische afbeelding van een bronafbeelding door een twaalfvoudige symmetrie toe te passen.";"CILanczosScaleTransform" = "Produceert een vergrote of verkleinde versie van de bronafbeelding met hoge kwaliteit. Doorgaans wordt dit filter gebruikt om afbeeldingen kleiner te maken.";"CILenticularHaloGenerator" = "Bootst een halo na die wordt gegenereerd door de diffractie die wordt geassocieerd met de spreiding van een lens. Dit filter wordt meestal toegepast op een andere afbeelding om lichtinval in de lens en vergelijkbare effecten na te bootsen.";"CILineOverlay" = "Creëert een schets waarin de randen van de afbeelding als zwarte contouren worden weergegeven en de delen zonder contour doorzichtig worden gelaten. Het resultaat bevat alfa en wordt in zwart weergegeven, zodat het pas wat wordt als u het over een andere afbeelding rendert via bron over composite.";"CILineScreen" = "Bootst het lijnpatroon van een halftintraster na.";"CILinearGradient" = "Genereert een gradiënt die varieert langs een lineaire as tussen twee opgegeven eindpunten.";"CIMaskToAlpha" = "Zet een grijstintafbeelding om in een witafbeelding met alfa als masker. De witwaarden van de bronafbeelding produceren de binnenkant van het masker. De zwartwaarden worden volkomen doorzichtig.";"CIMaximumCompositing" = "Berekent de maximumwaarde voor elke kleurcomponent van twee invoerafbeeldingen en creëert een uitvoerafbeelding op basis van die maximumwaarden. Vergelijkbaar met dodging.";"CIMedianFilter" = "Berekent de gemiddelde waarde voor een groep aaneengrenzende pixels en vervangt elke pixelwaarde door de gemiddelde waarde. Hierdoor wordt ruis verminderd.";"CIMinimumCompositing" = "Berekent de minimumwaarde voor elke kleurcomponent van twee invoerafbeeldingen en creëert een uitvoerafbeelding op basis van die minimumwaarden. Vergelijkbaar met burning.";"CIModTransition" = "Laat een afbeelding overgaan in een andere door de doelafbeelding zichtbaar te maken via onregelmatig gevormde gaten.";"CIMotionBlur" = "Vervaagt een afbeelding om het effect na te bootsen van een camera die onder een bepaalde hoek en over een bepaalde afstand beweegt tijdens het vastleggen van de afbeelding.";"CIMultiplyCompositing" = "Vermenigvuldigt de kleurcomponent van twee invoerafbeeldingen en creëert een uitvoerafbeelding op basis van de vermenigvuldigde waarden. Dit filter wordt meestal gebruikt om het effect van een schijnwerper of een vergelijkbaar effect aan een afbeelding toe te voegen.";"CINoiseReduction" = "Vermindert ruis op basis van een drempelwaarde die bepaalt wat als ruis wordt beschouwd. Kleine wijzigingen in luminantie onder de drempelwaarde worden als ruis beschouwd, zodat ruisvermindering wordt toegepast in de vorm van een lokale vervaging. Wijzigingen die boven de drempelwaarde blijven, worden als randen beschouwd en worden scherper gemaakt.";"CIOpTile" = "Verdeelt een afbeelding in segmenten, past daar opgegeven vergroting/verkleining en rotatie op toe en voegt de afbeelding weer samen, zodat een opart-effect ontstaat.";"CIPageCurlTransition" = "Laat een afbeelding overgaan in een andere door het omslaan van een pagina na te bootsen, waarbij de nieuwe afbeelding zichtbaar wordt onder de pagina die wordt omgeslagen.";"CIParallelogramTile" = "Vervormt een afbeelding door deze te weerspiegelen in een parallellogram en verdeelt het resultaat in tegels.";"CIPerspectiveTile" = "Past een perspectieftransformatie toe op een afbeelding en verdeelt het resultaat in tegels.";"CIPerspectiveTransform" = "Wijzigt de geometrie van een afbeelding om na te bootsen dat het gezichtspunt van de toeschouwer verandert. U kunt het perspectieffilter gebruiken om een afbeelding te laten hellen.";"CIPinchDistortion" = "Creëert een rechthoekig gebied dat de bronpixels naar binnen toe samenknijpt, waarbij de pixels het dichtst bij de rechthoek het meest worden vervormd.";"CIPixellate" = "Creëert een blokeffect in een afbeelding.";"CIPointillize" = "Geeft de bronafbeelding weer in een pointillistische stijl.";"CIRadialGradient" = "Genereert een gradiënt die radiaal varieert tussen twee cirkels met hetzelfde middelpunt. Een van de twee cirkels mag een radius van 0 hebben.";"CIRandomGenerator" = "Genereert een afbeelding die zich oneindig uitstrekt en waarvan de pixelwaarden zijn opgebouwd uit vier onafhankelijke, gelijkelijk verdeelde, willekeurige nummers tussen 0 en 1.";"CIRippleTransition" = "Laat een afbeelding overgaan in een andere door een cirkelvormige golving te creëren die vanuit het middelpunt begint en in het kielzog van de golf de nieuwe afbeelding zichtbaar maakt.";"CISepiaTone" = "Koppelt de kleuren van een afbeelding aan verschillende bruintinten.";"CIShadedMaterial" = "Produceert een getinte afbeelding van een hoogteveld. Het hoogteveld is zo gedefinieerd dat grotere hoogten lichtere tinten hebben en kleinere hoogten (lagere gedeelten) donkerdere tinten. U kunt dit filter combineren met het CIHeightFieldFromMask-filter om snel maskers met schaduwwerking, zoals tekst, te maken.";"CISharpenLuminance" = "Vergroot de details van een afbeelding door verscherping. De luminantie van de afbeelding wordt aangepast. De chrominantie van de pixels blijft ongewijzigd.";"CISixfoldReflectedTile" = "Produceert een tegelafbeelding van een bronafbeelding door een zesvoudig weerspiegelde symmetrie toe te passen.";"CISixfoldRotatedTile" = "Produceert een tegelafbeelding van een bronafbeelding door de bron in stappen van 60 graden te draaien.";"CISourceAtopCompositing" = "Plaatst de bronafbeelding over de achtergrondafbeelding en gebruikt vervolgens de luminantie van de achtergrondafbeelding om te bepalen wat er zichtbaar wordt gemaakt. De samengestelde afbeelding toont de achtergrondafbeelding en alleen die gedeelten van de bronafbeelding die over zichtbare delen van de achtergrond liggen.";"CISourceInCompositing" = "Gebruikt de tweede afbeelding om te bepalen wat er in de bronafbeelding achter moet blijven, zodat de afbeelding feitelijk wordt bijgesneden.";"CISourceOutCompositing" = "Gebruikt de tweede afbeelding om te bepalen wat er uit de eerste afbeelding moet worden weggehaald.";"CISourceOverCompositing" = "Plaatst de tweede afbeelding over de eerste.";"CISpotColor" = "Vervangt een of meer kleurbereiken door spotkleuren.";"CISpotLight" = "Past een gericht schijnwerpereffect toe op een afbeelding.";"CIStarShineGenerator" = "Genereert een sterpatroon. De uitvoerafbeelding wordt meestal gebruikt als invoer voor een ander filter.";"CIStripesGenerator" = "Genereert een streeppatroon. U kunt u de kleur van de strepen, de ruimte tussen de strepen en het contrast instellen.";"CISunbeamsGenerator" = "Genereert een zoneffect. De uitvoer van het zonnestraalfilter wordt doorgaans gebruikt als invoer voor een compositefilter.";"CISwipeTransition" = "Laat een afbeelding overgaan in een andere door een vegende beweging na te bootsen.";"CITorusLensDistortion" = "Creëert een torusvormige lens en vervormt het gedeelte van de afbeelding waarover de lens is geplaatst.";"CITriangleTile" = "Koppelt een driehoekig gedeelte van een afbeelding aan een driehoekig gebied en verdeelt vervolgens het resultaat in tegels.";"CITwelvefoldReflectedTile" = "Produceert een tegelafbeelding van een bronafbeelding door een twaalfvoudig weerspiegelde symmetrie toe te passen.";"CITwirlDistortion" = "Roteert pixels rond een punt om een tollend effect te creëren. U kunt het aantal draaiingen, het middelpunt en de radius van het effect instellen.";"CIUnsharpMask" = "Vergroot het contrast van de randen tussen pixels van verschillende kleuren in een afbeelding.";"CIVortexDistortion" = "Roteert pixels rond een punt om een draaikolk na te bootsen. U kunt het aantal draaiingen, het middelpunt en de radius van het effect instellen.";"CIWhitePointAdjust" = "Past het referentiewitpunt voor een afbeelding aan en koppelt alle kleuren in de bron aan de nieuwe referentie.";"CIZoomBlur" = "Bootst het effect na van in- of uitzoomen met de camera tijdens het maken van de opname.";"CIColorBlendMode" = "Gebruikt de luminantiewaarden van de achtergrond in combinatie met de tint- en verzadigingswaarden van de bronafbeelding. In deze modus blijven de grijsniveaus in de afbeelding behouden.";"CIColorBurnBlendMode" = "Maakt de samples van de achtergrondafbeelding donkerder om de samples van de bronafbeelding te weerspiegelen. Als de waarden voor de samples van de bronafbeelding wit aangeven, wordt er niets gewijzigd.";"CIColorDodgeBlendMode" = "Maakt de samples van de achtergrondafbeelding lichter, zodat ze de samples van de bronafbeelding weerspiegelen. Als de waarden voor de samples van de bronafbeelding zwart aangeven, wordt er niets gewijzigd.";"CIDarkenBlendMode" = "Creëert samengestelde afbeeldingssamples door de donkerdere samples te kiezen (uit de bronafbeelding of de achtergrond). Het resultaat hiervan is dat samples van de achtergrondafbeelding worden vervangen door samples van de bronafbeelding als de laatste donkerder zijn. Anders blijven de samples van de achtergrondafbeelding ongewijzigd.";"CIDifferenceBlendMode" = "Trekt de samplekleur van de bronafbeelding af van de samplekleur van de achtergrondafbeelding, of doet het omgekeerde, afhankelijk van welke sample de grootste helderheidswaarde heeft. Als de samplewaarden van de bronafbeelding zwart zijn, verandert er niets. Als de waarde wit is, worden de achtergrondkleurwaarden omgekeerd.";"CIExclusionBlendMode" = "Produceert een effect dat vergelijkbaar is met het CIDifferenceBlendMode-filter, maar minder contrast bevat. Als de samplewaarden van de bronafbeelding zwart zijn, verandert er niets. Als de waarde wit is, worden de achtergrondkleurwaarden omgekeerd.";"CIHardLightBlendMode" = "Vermenigvuldigt of rastert kleuren, afhankelijk van de samplekleur van de bronafbeelding. Als de samplekleur van de bronafbeelding lichter is dan 50% grijs, wordt de achtergrond lichter gemaakt, net als bij rasteren. Als de samplekleur van de bronafbeelding donkerder is dan 50% grijs, wordt de achtergrond donkerder gemaakt, net als bij vermenigvuldigen. Als de samplekleur van de bronafbeelding precies 50% grijs is, blijft de bronafbeelding ongewijzigd. Afbeeldingssamples die gelijk zijn aan puur zwart of puur wit, hebben puur zwart of wit als resultaat. Het algehele effect is vergelijkbaar met het effect dat ontstaat als een felle schijnwerper op de bronafbeelding wordt gericht.";"CIHueBlendMode" = "Gebruikt de luminantie- en verzadigingswaarden van de achtergrond in combinatie met de tint van de bronafbeelding.";"CILightenBlendMode" = "Creëert samengestelde afbeeldingssamples door de lichtere samples te kiezen (uit de bronafbeelding of de achtergrond). Het resultaat hiervan is dat samples van de achtergrondafbeelding worden vervangen door samples van de bronafbeelding als de laatste lichter zijn. Anders blijven de samples van de achtergrondafbeelding ongewijzigd.";"CILuminosityBlendMode" = "Gebruikt de tint en verzadiging van de achtergrond in combinatie met de luminantie van de bronafbeelding. Deze modus creëert een effect dat omgekeerd is ten opzichte van het effect van het CIColorBlendMode-filter.";"CIMultiplyBlendMode" = "Vermenigvuldigt samples van de bronafbeelding met de samples van de achtergrondafbeelding. Het resultaat zijn kleuren die minimaal net zo donker zijn als elk van beide gebruikte samplekleuren.";"CIOverlayBlendMode" = "Vermenigvuldigt of rastert de samples van de bronafbeeldingen met de samples van de achtergrondafbeelding, afhankelijk van de achtergrondkleur. Het resultaat is een laag over de bestaande afbeeldingssamples waarbij de lichte delen en schaduwen van de achtergrond behouden blijven. De achtergrondkleur wordt vermengd met de bronafbeelding om de lichte of donkere delen van de achtergrond weer te geven.";"CISaturationBlendMode" = "Gebruikt de luminantie- en tintwaarden van de achtergrond in combinatie met de verzadiging van de bronafbeelding. Gedeelten van de achtergrond die geen verzadiging hebben (dat wil zeggen puur grijze gedeelten) worden niet gewijzigd.";"CIScreenBlendMode" = "Vermenigvuldigt de omkering van de samples van de bronafbeelding met de omkering van de samples van de achtergrondafbeelding. Het resultaat zijn kleuren die minimaal net zo licht zijn als elk van de twee gebruikte samplekleuren.";"CISoftLightBlendMode" = "Maakt kleuren donkerder of lichter, afhankelijk van de samplekleur van de bronafbeelding. Als de samplekleur van de bronafbeelding lichter is dan 50% grijs, wordt de achtergrond lichter gemaakt, net als bij dodging. Als de samplekleur van de bronafbeelding donkerder is dan 50% grijs, wordt de achtergrond donkerder gemaakt, net als bij burning. Als de samplekleur van de bronafbeelding precies 50% grijs is, blijft de achtergrond ongewijzigd. Afbeeldingssamples die gelijk zijn aan puur zwart of puur wit, produceren donkerdere of lichtere gedeelten, maar resulteren niet in puur zwart of wit. Het algehele effect is vergelijkbaar met het effect dat ontstaat als een diffuse schijnwerper op de bronafbeelding wordt gericht.";"outputImage" = "De afbeelding die door een filter wordt geproduceerd.";"inputBackgroundImage" = "De afbeelding die als achtergrondafbeelding moet worden gebruikt.";"inputImage" = "De afbeelding die moet worden gebruikt als invoerafbeelding. Voor filters die ook een achtergrondafbeelding gebruiken is dit de voorgrondafbeelding.";"inputTime" = "De duur van het effect.";"inputTransform" = "Een transformatie die moet worden toegepast.";"inputScale" = "De mate van het effect.";"inputAspectRatio" = "Een verhouding.";"inputCenter" = "Het middelpunt van het gebied, als x- en y-coördinaat, dat moet worden gefilterd.";"inputRadius" = "De afstand vanaf het middelpunt van het effect.";"inputAngle" = "Een hoek.";"inputRefraction" = "De index van de lichtbreking van het materiaal (zoals glas) dat in het effect wordt gebruikt.";"inputWidth" = "De breedte van het effect.";"inputSharpness" = "De mate van verscherping die moet worden toegepast.";"inputIntensity" = "De intensiteit van het effect.";"inputEV" = "Het aantal f-stops dat de afbeelding lichter of donkerder moet worden.";"inputSaturation" = "De mate waarin de verzadiging wordt aangepast.";"inputColor" = "Een kleur.";"inputBrightness" = "Een helderheidsniveau.";"inputContrast" = "Een contrastniveau.";"inputGradientImage" = "Een omgevingskoppeling met alfa. Doorgaans is dit een afbeelding met lichte delen en schaduw.";"inputMaskImage" = "Een afbeelding die als masker wordt gebruikt.";"inputShadingImage" = "Een omgevingskoppeling met alfawaarden. Doorgaans is dit een afbeelding met lichte delen en schaduw.";"inputTargetImage" = "De doelafbeelding voor een overgang.";"inputExtent" = "Een rechthoek die bepaalt hoe ver het effect zich uitstrekt.";"CIBoxBlur.inputRadius" = "De radius bepaalt hoeveel pixels er worden gebruikt om de vervaging te creëren. Hoe groter de radius, des te vager het resultaat.";"CIDiscBlur.inputRadius" = "De radius bepaalt hoeveel pixels er worden gebruikt om de vervaging te creëren. Hoe groter de radius, des te vager het resultaat.";"CIGaussianBlur.inputRadius" = "De radius bepaalt hoeveel pixels er worden gebruikt om de vervaging te creëren. Hoe groter de radius, des te vager het resultaat.";"CIMotionBlur.inputRadius" ="De radius bepaalt hoeveel pixels er worden gebruikt om de vervaging te creëren. Hoe groter de radius, des te vager het resultaat.";"CIMotionBlur.inputAngle" = "De hoek van de beweging bepaalt in welke richting de vervaging uitsmeert.";"CINoiseReduction.inputNoiseLevel" = "De mate van ruisvermindering. Hoe groter de waarde, des te meer ruisvermindering.";"CINoiseReduction.inputSharpness" = "De scherpte van de uiteindelijke afbeelding. Hoe groter de waarde, des te scherper het resultaat.";"CIZoomBlur.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect.";"CIZoomBlur.inputAmount" = "De mate van inzoomen. Hoe groter de waarde, des te meer wordt ingezoomd.";"CIColorControls.inputSaturation" = "De mate van verzadiging die wordt toegepast. Hoe groter de waarde, des te meer verzadiging het resultaat krijgt.";"CIColorControls.inputBrightness" = "De mate van helderheid die wordt toegepast. Hoe groter de waarde, des te helderder het resultaat.";"CIColorControls.inputContrast" = "De mate van contrast die wordt toegepast. Hoe groter de waarde, des te meer contrast de afbeelding krijgt.";"CIColorMatrix.inputRVector" = "De hoeveelheid rood waarmee de bronkleurwaarden moeten worden vermenigvuldigd.";"CIColorMatrix.inputGVector" = "De hoeveelheid groen waarmee de bronkleurwaarden moeten worden vermenigvuldigd.";"CIColorMatrix.inputBVector" = "De hoeveelheid blauw waarmee de bronkleurwaarden moeten worden vermenigvuldigd.";"CIColorMatrix.inputAVector" = "De hoeveelheid alfa waarmee de bronkleurwaarden moeten worden vermenigvuldigd.";"CIColorMatrix.inputBiasVector" = "Een vector die aan elke kleurcomponent wordt toegevoegd.";"CIExposureAdjust.inputEV" = "De mate waarmee de belichting van de afbeelding wordt aangepast. Hoe groter de waarde, des te meer belichting.";"CIGammaAdjust.inputPower" = "Een gammawaarde om de helderheid van de afbeelding te corrigeren. Hoe groter de waarde, hoe donkerder het resultaat.";"CIHueAdjust.inputAngle" = "Een hoek (in graden) waarmee de tint van een afbeelding moet worden gecorrigeerd.";"CIWhitePointAdjust.inputColor" = "Een kleur die moet worden gebruikt als het witpunt.";"CIColorCube.inputDimension" = "De afmetingen van de kleurtabel.";"CIColorCube.inputCubeData" = "Dit is een kleurtabel met drijvende-komma-RGBA-cellen die vooraf vermenigvuldigd alfa gebruiken. De cellen zijn geordend in een standaardvolgorde. De kolommen en rijen met gegevens worden geïndexeerd door respectievelijk rood en groen. Elk gegevensvlak wordt gevolgd door het eerstvolgende hogere vlak in de gegevens, waarbij vlakken worden geïndexeerd door blauw.";"CIColorMap.inputGradientImage" = "De afbeeldingsgegevens van deze afbeelding transformeren de waarden van de bronafbeelding.";"CIColorMonochrome.inputColor" = "De monochrome kleur die op de afbeelding moet worden toegepast.";"CIColorMonochrome.inputIntensity" = "De intensiteit van het monochrome effect. Een waarde van 1,0 creëert een monochrome afbeelding op basis van de verstrekte kleur. Een waarde van 0,0 heeft geen effect op de afbeelding.";"CIColorPosterize.inputLevels" = "Het aantal helderheidsniveaus dat moet worden gebruikt voor elke kleurcomponent. Lagere waarden hebben een extremer postereffect als resultaat.";"CIFalseColor.inputColor0" = "De eerste kleur die moet worden gebruikt voor het kleurverloop.";"CIFalseColor.inputColor1" = "De tweede kleur die moet worden gebruikt voor het kleurverloop.";"CISepiaTone.inputIntensity" = "De intensiteit van het sepia-effect. Met een waarde van 1,0 ontstaat een monochrome sepia-afbeelding. Een waarde van 0,0 heeft geen effect op de afbeelding.";"CIBumpDistortion.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van de hobbel."; "CIBumpDistortion.inputRadius" = "De radius bepaalt hoeveel pixels worden gebruikt om de vervorming tot stand te brengen. Hoe groter de radius, des te verder de vervorming zich uitstrekt."; "CIBumpDistortion.inputScale" = "De schaal van het effect bepaalt de kromming van de hobbel. Een waarde van 0,0 heeft geen effect. Positieve waarden creëren een uitwaartse hobbel. Negatieve waarden creëren een inwaartse hobbel."; "CIBumpDistortionLinear.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van de vervorming."; "CIBumpDistortionLinear.inputRadius" = "De radius bepaalt hoeveel pixels worden gebruikt om de vervorming tot stand te brengen. Hoe groter de radius, des te verder de vervorming zich uitstrekt.";  "CIBumpDistortionLinear.inputScale" = "De schaal van het effect."; "CIBumpDistortionLinear.inputAngle" = "De hoek (in graden) van de lijn waaromheen de vervorming plaatsvindt."; "CICircleSplashDistortion.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van de vervorming.";  "CICircleSplashDistortion.inputRadius" = "De radius bepaalt hoeveel pixels worden gebruikt om de vervorming tot stand te brengen. Hoe groter de radius, des te verder de vervorming zich uitstrekt.";  "CICircularWrap.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van de vervorming.";  "CICircularWrap.inputRadius" = "De radius bepaalt hoeveel pixels worden gebruikt om de vervorming tot stand te brengen. Hoe groter de radius, des te verder de vervorming zich uitstrekt.";  "CICircularWrap.inputAngle" = "De hoek van het effect."; "CIDisplacementDistortion.inputDisplacementImage" = "Een afbeelding waarvan de grijswaarden worden toegepast op de bronafbeelding."; "CIDisplacementDistortion.inputScale" = "De mate van textuur in de resulterende afbeelding. Hoe groter de waarde, des te sterker de textuur."; "CIGlassDistortion.inputTexture" = "Een textuur die moet worden toegepast op de bronafbeelding.";"CIGlassDistortion.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van de vervorming."; "CIGlassDistortion.inputScale" = "De mate van textuur in de resulterende afbeelding. Hoe groter de waarde, des te sterker de textuur."; "CIGlassLozenge.inputPoint0" = "De x- en de y-positie die worden gebruikt als het middelpunt van de cirkel aan een uiteinde van de capsule."; "CIGlassLozenge.inputPoint1" = "De x- en de y-positie die worden gebruikt als het middelpunt van de cirkel aan het andere uiteinde van de capsule.";  "CIGlassLozenge.inputRadius" = "De radius van de capsule. Hoe groter de radius, des te verder de vervorming zich uitstrekt.";  "CIGlassLozenge.inputRefraction" = "De lichtbreking van het glas."; "CIHoleDistortion.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van de vervorming.";  "CIHoleDistortion.inputRadius" = "De radius bepaalt hoeveel pixels worden gebruikt om de vervorming tot stand te brengen. Hoe groter de radius, des te verder de vervorming zich uitstrekt.";  "CIPinchDistortion.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van de vervorming."; "CIPinchDistortion.inputRadius" = "De radius bepaalt hoeveel pixels worden gebruikt om de vervorming tot stand te brengen. Hoe groter de radius, des te verder de vervorming zich uitstrekt."; "CIPinchDistortion.inputScale" = "De mate van samenknijpen. Een waarde van 0,0 is geen effect. Een waarde van 1,0 is het maximale effect.";"CITorusLensDistortion.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van de torus.";  "CITorusLensDistortion.inputRadius" = "De buitenste radius van de torus.";  "CITorusLensDistortion.inputWidth" = "De breedte van de ring."; "CITorusLensDistortion.inputRefraction" = "De lichtbreking van het glas."; "CITwirlDistortion.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van de vervorming.";  "CITwirlDistortion.inputRadius" = "De radius bepaalt hoeveel pixels worden gebruikt om de vervorming tot stand te brengen. Hoe groter de radius, des te verder de vervorming zich uitstrekt."; "CITwirlDistortion.inputAngle" = "De hoek (in graden) van het tollende effect. Waarden kunnen positief of negatief zijn.";"CIVortexDistortion.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van de vervorming."; "CIVortexDistortion.inputRadius" = "De radius bepaalt hoeveel pixels worden gebruikt om de vervorming tot stand te brengen. Hoe groter de radius, des te verder de vervorming zich uitstrekt."; "CIVortexDistortion.inputAngle" = "De hoek (in graden) van de draaikolk.";"CICheckerboardGenerator.inputColor0" = "Een kleur voor de eerste set van de dambordvierkanten.";"CICheckerboardGenerator.inputColor1" = "Een kleur voor de tweede set van de dambordvierkanten.";"CICheckerboardGenerator.inputWidth" = "De breedte van een vierkant in het dambordpatroon.";"CICheckerboardGenerator.inputSharpness" = "De scherpte van het dambordpatroon. Hoe kleiner de waarde, des te vager het patroon. Waarden liggen tussen 0,0 en 1,0.";"CIConstantColorGenerator.inputColor" = "De kleur die moet worden gegenereerd."; "CILenticularHaloGenerator.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van de halo.";"CILenticularHaloGenerator.inputHaloRadius" = "De radius van de halo.";"CILenticularHaloGenerator.inputHaloWidth" = "De breedte van de halo, gemeten vanaf de binnenradius tot de buitenradius.";"CILenticularHaloGenerator.inputOverlap" = "De hoeveelheid overlapping van de diffractiecomponenten van de halo. Een waarde van 1,0 betekent totale overlapping en een witte halo. Een waarde van 0,0 betekent geen overlapping van de halokleuren.";"CILenticularHaloGenerator.inputStriationStrength" = "De intensiteit van de halokleuren. Hoe groter de waarden, des te groter de intensiteit.";"CILenticularHaloGenerator.inputStriationContrast" = "Het contrast van de halokleuren. Hoe groter de waarden, des te hoger het contrast.";"CIStarShineGenerator.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van de ster."; "CIStarShineGenerator.inputColor" = "De kleur die moet worden gebruikt voor de buitenste schil van de cirkelvormige ster."; "CIStarShineGenerator.inputRadius" = "De radius van de ster."; "CIStarShineGenerator.inputCrossScale" = "De grootte van het kruispatroon."; "CIStarShineGenerator.inputCrossAngle" = "De hoek van het kruispatroon."; "CIStarShineGenerator.inputCrossOpacity" = "De dichtheid van het kruispatroon."; "CIStarShineGenerator.inputCrossWidth" = "De breedte van het kruispatroon."; "CIStarShineGenerator.inputEpsilon" = "De lengte van de punten."; "CIStripesGenerator.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het streeppatroon."; "CIStripesGenerator.inputColor0" = "Een kleur die moet worden gebruikt voor de oneven strepen."; "CIStripesGenerator.inputColor1" = "Een kleur die moet worden gebruikt voor de even strepen.";"CIStripesGenerator.inputWidth" = "De breedte van een streep."; "CIStripesGenerator.inputSharpness" = "De scherpte van het streeppatroon. Hoe kleiner de waarde, hoe vager het patroon. Waarden liggen tussen 0,0 en 1,0."; "CISunbeamsGenerator.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het zonnestraalpatroon.";"CISunbeamsGenerator.inputColor" = "De kleur van de zon.";"CISunbeamsGenerator.inputSunRadius" = "De radius van de zon.";"CISunbeamsGenerator.inputMaxStriationRadius" = "De radius van de zonnestralen.";"CISunbeamsGenerator.inputStriationStrength" = "De intensiteit van de zonnestralen. Hoe groter de waarden, des te groter de intensiteit.";"CISunbeamsGenerator.inputStriationContrast" = "Het contrast van de zonnestralen. Hoe hoger de waarden, des te meer contrast.";"CIAffineTransform.inputTransform" = "Een transformatie die op de afbeelding moet worden toegepast."; "CICrop.inputRectangle" = "De rechthoek die bepaalt hoe de afbeelding moet worden bijgesneden."; "CILanczosScaleTransform.inputScale" = "De vergrotings/verkleiningsfactor voor de afbeelding. Met waarden kleiner dan 1,0 worden de afbeeldingen kleiner. Met waarden groter dan 1,0 worden ze groter."; "CILanczosScaleTransform.inputAspectRatio" = "De verhouding tussen hoogte en breedte van de afbeelding."; "CIPerspectiveTransform.inputTopLeft" = "De linkerbovencoördinaat waaraan de afbeelding wordt gekoppeld."; "CIPerspectiveTransform.inputTopRight" = "De rechterbovencoördinaat waaraan de afbeelding wordt gekoppeld."; "CIPerspectiveTransform.inputBottomRight" = "De rechterbenedencoördinaat waaraan de afbeelding wordt gekoppeld."; "CIPerspectiveTransform.inputBottomLeft" = "De linkerbenedencoördinaat waaraan de afbeelding wordt gekoppeld."; "CIGaussianGradient.inputColor0" = "De eerste kleur die moet worden gebruikt voor de gradiënt."; "CIGaussianGradient.inputColor1" = "De tweede kleur die moet worden gebruikt voor de gradiënt."; "CIGaussianGradient.inputRadius" = "De radius van de Gaussiaanse verdeling."; "CILinearGradient.inputPoint0" = "De beginpositie van de gradiënt (waar de eerste kleur begint)."; "CILinearGradient.inputPoint1" = "De eindpositie van de gradiënt (waar de tweede kleur begint)."; "CILinearGradient.inputColor0" = "De eerste kleur die moet worden gebruikt voor de gradiënt.";  "CILinearGradient.inputColor1" = "De tweede kleur die moet worden gebruikt voor de gradiënt.";  "CIRadialGradient.inputRadius0" = "De radius van de begincirkel die in de gradiënt moet worden gebruikt.";"CIRadialGradient.inputRadius1" = "De radius van de eindcirkel die in de gradiënt moet worden gebruikt.";"CIRadialGradient.inputColor0" = "De eerste kleur die moet worden gebruikt voor de gradiënt.";  "CIRadialGradient.inputColor1" = "De tweede kleur die moet worden gebruikt voor de gradiënt."; "CICircularScreen.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het cirkelvormige rasterpatroon."; "CICircularScreen.inputWidth" = "De afstand tussen elke cirkel in het patroon."; "CICircularScreen.inputSharpness" = "De scherpte van de cirkels. Hoe groter de waarde, des te scherper de cirkels."; "CICMYKHalftone.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het halftintpatroon.";  "CICMYKHalftone.inputWidth" = "De afstand tussen de stippen in het patroon."; "CICMYKHalftone.inputAngle" = "De hoek van het patroon."; "CICMYKHalftone.inputSharpness" = "De scherpte van het patroon. Hoe groter de waarde, des te scherper het patroon."; "CICMYKHalftone.inputGCR" = "De vervangingswaarde voor de grijscomponent. De waarde kan liggen tussen 0,0 (geen) en 1,0."; "CICMYKHalftone.inputUCR" = "De waarde voor verwijdering onder de kleur. De waarde kan liggen tussen 0,0 en 1,0."; "CIDotScreen.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het gestippelde rasterpatroon.";  "CIDotScreen.inputAngle" = "De hoek van het patroon."; "CIDotScreen.inputWidth" = "De afstand tussen de stippen in het patroon."; "CIDotScreen.inputSharpness" = "De scherpte van het patroon. Hoe groter de waarde, des te scherper het patroon."; "CIHatchedScreen.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het gearceerde rasterpatroon."; "CIHatchedScreen.inputAngle" = "De hoek van het patroon.";"CIHatchedScreen.inputWidth" = "De afstand tussen de lijnen in het patroon."; "CIHatchedScreen.inputShaprness" = "De scherpte van het patroon. Hoe groter de waarde, des te scherper het patroon."; "CILineScreen.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het lijnrasterpatroon.";  "CILineScreen.inputAngle" = "De hoek van het patroon."; "CILineScreen.inputWidth" = "De afstand tussen de lijnen in het patroon."; "CILineScreen.inputSharpness" = "De scherpte van het patroon. Hoe groter de waarde, des te scherper het patroon."; 	"CISharpenLuminance.inputSharpness" = "De mate van verscherping die moet worden toegepast. Hoe hoger de waarden, des te meer verscherping.";"CIUnsharpMask.inputRadius" = "De radius rond een bepaalde pixel waarbinnen het onscherp masker moet worden toegepast. Hoe groter de radius, hoe meer van de afbeelding verandert.";"CIUnsharpMask.inputIntensity" = "De intensiteit van het effect. Hoe groter de waarde, hoe meer contrast het desbetreffende gebied krijgt.";"CIBlendWithMask.inputMaskImage" = "Een grijstintmasker. Wanneer een maskerwaarde 0,0 is, is het resultaat de achtergrond. Wanneer de maskerwaarde 1,0 is, is het resultaat de afbeelding."; "CIBloom.inputRadius" = "De radius bepaalt hoeveel pixels worden gebruikt om het effect te creëren. Hoe groter de radius, des te groter het effect.";"CIBloom.inputIntensity" = "De intensiteit van het effect. Een waarde van 0,0 is geen effect. Een waarde van 1,0 is het maximale effect."; "CICrystallize.inputRadius" = "De radius bepaalt hoeveel pixels worden gebruikt om het effect te creëren. Hoe groter de radius, des te groter de kristallen in het resultaat."; "CIEdges.inputIntensity" = "De intensiteit van de randen. Hoe groter de waarde, des te groter de intensiteit."; "CIEdgeWork.inputRadius" = "De dikte van de randen. Hoe groter de waarde, des te dikker de randen."; "CIGloom.inputRadius" = "De radius bepaalt hoeveel pixels worden gebruikt om het effect te creëren. Hoe groter de radius, des te groter het effect."; "CIGloom.inputIntensity" = "De intensiteit van het effect. Een waarde van 0,0 is geen effect. Een waarde van 1,0 is het maximale effect."; "CIHeightFieldFromMask.inputImage" = "De witwaarden van het masker bepalen welke pixels binnen het hoogteveld liggen, terwijl de zwartwaarden bepalen welke pixels erbuiten liggen. Het veld varieert vloeiend en doorlopend binnen het masker, waarbij aan de rand van het masker de waarde 0 wordt bereikt."; "CIHeightFieldFromMask.inputRadius" = "De afstand van de rand van het masker voor de vloeiende overgang staat in verhouding tot de invoerradius. Met hogere waarden wordt de overgang vloeiender en duidelijker zichtbaar. Met kleinere waarden benadert de overgang een afrondingsradius."; "CIHexagonalPixellate.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect."; "CIHexagonalPixellate.inputScale" = "De schaal bepaalt de grootte van de zeshoeken. Hoe groter de waarde, des te groter de zeshoeken."; "CILineOverlay.inputNRNoiseLevel" = "Het ruisniveau van de afbeelding (gebruikt met cameragegevens) dat wordt verwijderd voordat de randen van de afbeelding worden getraceerd. Door het ruisniveau te verhogen, worden de getraceerde afbeeldingsranden duidelijker."; "CILineOverlay.inputNRSharpness" = "De mate van verscherping die wordt uitgevoerd bij het verwijderen van ruis in de afbeelding voordat de randen van de afbeelding worden getraceerd. Hierdoor worden betere randen verkregen."; "CILineOverlay.inputEdgeIntensity" = "De accentueringsfactor van de Sobel-gradiëntinformatie bij het traceren van de randen van de afbeelding. Met hogere waarden worden meer randen gevonden, al wordt doorgaans een lage waarde (zoals 1,0) gebruikt."; "CILineOverlay.inputThreshold" = "Deze waarde bepaald de zichtbaarheid van de randen. Grotere waarden maken de randen smaller."; "CILineOverlay.inputContrast" = "De mate van anti-aliasing die moet worden gebruikt voor de randen die door dit filter worden geproduceerd. Hogere waarden produceren randen met een hoger contrast (minder anti-aliasing toegepast)."; "CIPixellate.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect.";  "CIPixellate.inputScale" = "De schaal bepaalt de grootte van de vierkanten. Hoe groter de waarde, des te groter de vierkanten."; "CIPointillize.inputRadius" = "De radius van de cirkels in het resulterende patroon."; "CIPointillize.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect.";  "CIShadedMaterial.inputShadingImage" = "De afbeelding die wordt gebruikt als het hoogteveld. De resulterende afbeelding heeft grotere hoogten met lichtere tinten en kleinere hoogten (lagere gedeelten) met donkerdere tinten."; "CIShadedMaterial.inputScale" = "De schaal van het effect. Hoe hoger de waarde, des te dramatischer het effect."; "CISpotColor.inputCenterColor1" = "De middelste waarde van het eerste kleurbereik dat moet worden vervangen."; "CISpotColor.inputReplacementColor1" = "Een vervangingskleur voor het eerste kleurbereik."; "CISpotColor.inputCloseness1" = "Een waarde die aangeeft hoeveel de eerste kleur overeen moet komen voordat deze wordt vervangen."; "CISpotColor.inputContrast1" = "Het contrast van de eerste vervangingskleur."; "CISpotColor.inputCenterColor2" = "De middelste waarde van het tweede kleurbereik dat moet worden vervangen."; "CISpotColor.inputReplacementColor2" = "Een vervangingskleur voor het tweede kleurbereik.";"CISpotColor.inputCloseness2" = "Een waarde die aangeeft hoeveel de tweede kleur overeen moet komen voordat deze wordt vervangen."; "CISpotColor.inputContrast2" = "Het contrast van de tweede vervangingskleur."; "CISpotColor.inputCenterColor3" = "De middelste waarde van het derde kleurbereik dat moet worden vervangen.";  "CISpotColor.inputReplacementColor3" = "Een vervangingskleur voor het derde kleurbereik."; "CISpotColor.inputCloseness3" = "Een waarde die aangeeft hoeveel de derde kleur overeen moet komen voordat deze wordt vervangen.";  "CISpotColor.inputContrast3" = "Het contrast van de derde vervangingskleur.";  "CISpotLight.inputLightPosition" = "De x- en de y-positie van de schijnwerper."; 		"CISpotLight.inputLightPointsAt" = "De x- en de y-positie waarop de schijnwerper gericht is.";  "CISpotLight.inputBrightness" = "De helderheid van de schijnwerper."; "CISpotLight.inputConcentration" = "De grootte van de schijnwerper. Hoe kleiner de waarde, des te geconcentreerder de lichtbundel is."; "CISpotLight.inputColor" = "De kleur van de schijnwerper."; "CIAffineClamp.inputTransform" = "De transformatie die op de afbeelding moet worden toegepast."; "CIAffineTile.inputTransform" = "De transformatie die op de afbeelding moet worden toegepast."; "CIEightfoldReflectedTile.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect.";  "CIEightfoldReflectedTile.inputAngle" = "De hoek (in graden) van het tegelpatroon."; "CIEightfoldReflectedTile.inputWidth" = "De breedte van een tegel."; "CIFourfoldReflectedTile.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect.";  "CIFourfoldReflectedTile.inputAngle" = "De hoek (in graden) van het tegelpatroon.";  "CIFourfoldReflectedTile.inputAcuteAngle" = "De primaire hoek voor de zich herhalende gespiegelde tegel. Met lage waarden ontstaan smalle, ruitvormige tegels. Met hogere waarden ontstaan bredere gespiegelde tegels."; "CIFourfoldReflectedTile.inputWidth" = "De breedte van een tegel.";  "CIFourfoldRotatedTile.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect.";  "CIFourfoldRotatedTile.inputAngle" = "De hoek (in graden) van het tegelpatroon.";  "CIFourfoldRotatedTile.inputWidth" = "De breedte van een tegel."; "CIFourfoldTranslatedTile.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect.";  "CIFourfoldTranslatedTile.inputAngle" = "De hoek (in graden) van het tegelpatroon.";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "De primaire hoek voor de zich herhalende omgezette tegel. Met lage waarden ontstaan smalle, ruitvormige tegels. Met hogere waarden ontstaan bredere omgezette tegels."; "CIFourfoldTranslatedTile.inputWidth" = "De breedte van een tegel.";  "CIGlideReflectedTile.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect.";  "CIGlideReflectedTile.inputAngle" = "De hoek (in graden) van het tegelpatroon.";  "CIGlideReflectedTile.inputWidth" = "De breedte van een tegel.";  "CIKaleidoscope.inputCount" = "Het aantal weerspiegelingen in het patroon"; "CIKaleidoscope.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect.";  "CIKaleidoscope.inputAngle" = "De hoek van de weerspiegeling."; "CIOpTile.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect.";  "CIOpTile.inputScale" = "De schaal bepaalt het aantal tegels in het effect."; "CIOpTile.inputAngle" = "De hoek van een tegel."; "CIOpTile.inputWidth" = "De breedte van een tegel."; "CIParallelogramTile.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect."; "CIParallelogramTile.inputAngle" = "De hoek (in graden) van het tegelpatroon.";  "CIParallelogramTile.inputAcuteAngle" = "De primaire hoek voor de zich herhalende parallellogramtegel. Met lage waarden ontstaan smalle, ruitvormige tegels. Met grotere waarden ontstaan bredere parallellogramtegels."; "CIParallelogramTile.inputWidth" = "De breedte van een tegel.";  "CIPerspectiveTile.inputTopLeft" = "De linkerbovencoördinaat van een tegel."; "CIPerspectiveTile.inputTopRight" = "De rechterbovencoördinaat van een tegel.";"CIPerspectiveTile.inputBottomRight" = "De rechterbenedencoördinaat van een tegel."; "CIPerspectiveTile.inputBottomLeft" = "De linkerbenedencoördinaat van een tegel."; "CISixfoldReflectedTile.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect.";  "CISixfoldReflectedTile.inputAngle" = "De hoek (in graden) van het tegelpatroon.";  "CISixfoldReflectedTile.inputWidth" = "De breedte van een tegel."; "CISixfoldRotatedTile.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect."; "CISixfoldRotatedTile.inputAngle" = "De hoek (in graden) van het tegelpatroon.";  "CISixfoldRotatedTile.inputWidth" = "De breedte van een tegel.";  "CITriangleTile.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect.";  "CITriangleTile.inputAngle" = "De hoek (in graden) van het tegelpatroon.";  "CITriangleTile.inputWidth" = "De breedte van een tegel.";  "CITwelvefoldReflectedTile.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect."; "CITwelvefoldReflectedTile.inputAngle" = "De hoek (in graden) van het tegelpatroon.";"CITwelvefoldReflectedTile.inputWidth" = "De breedte van een tegel."; "CIBarsSwipeTransition.inputAngle" = "De hoek (in graden) van de balken.";	"CIBarsSwipeTransition.inputWidth" = "De breedte van elke balk.";	"CIBarsSwipeTransition.inputBarOffset" = "De verschuiving van een balk ten opzichte van een andere.";	"CIBarsSwipeTransition.inputTime" = "De parametrische tijd van de overgang. Deze waarde bepaalt de overgang van begin (tijdwaarde 0) tot eind (tijdwaarde 1).";"CICopyMachineTransition.inputColor" = "De kleur van de kopieerlamp.";"CICopyMachineTransition.inputAngle" = "De hoek van de kopieerlamp.";"CICopyMachineTransition.inputWidth" = "De breedte van de kopieerlamp.";"CICopyMachineTransition.inputOpacity" = "De dichtheid van de kopieerlamp. Een waarde van 0,0 is doorzichtig. Een waarde van 1,0 is ondoorzichtig.";"CICopyMachineTransition.inputTime" = "De parametrische tijd van de overgang. Deze waarde bepaalt de overgang van begin (tijdwaarde 0) tot eind (tijdwaarde 1).";"CIDisintegrateWithMaskTransition.inputMaskImage" = "Een afbeelding die bepaalt welke vorm wordt gebruikt voor de desintegratie van de bronafbeelding in de doelafbeelding.";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "De radius van de schaduw die wordt gecreëerd door het masker.";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "De dichtheid van de schaduw die wordt gecreëerd door het masker.";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "De verschuiving van de schaduw die wordt gecreëerd door het masker.";"CIDisintegrateWithMaskTransition.inputTime" = "De parametrische tijd van de overgang. Deze waarde bepaalt de overgang van begin (tijdwaarde 0) tot eind (tijdwaarde 1).";"CIDissolveTransition.inputTime" = "De parametrische tijd van de overgang. Deze waarde bepaalt de overgang van begin (tijdwaarde 0) tot eind (tijdwaarde 1).";"CIFlashTransition.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect."; "CIFlashTransition.inputExtent" = "Het bereik van de flitser.";"CIFlashTransition.inputColor" = "De kleur van de lichtstralen die de flitser uitstraalt.";"CIFlashTransition.inputMaxStriationRadius" = "De radius van de lichtstralen die de flitser uitstraalt.";"CIFlashTransition.inputStriationStrength" = "De sterkte van de lichtstralen die de flitser uitstraalt.";"CIFlashTransition.inputStriationContrast" = "Het contrast van de lichtstralen die de flitser uitstraalt.";"CIFlashTransition.inputFadeThreshold" = "De mate van afzwakking tussen de flitser en de doelafbeelding. Hoe hoger de waarde, des te langer de flits duurt en des te korter de afzwakkingstijd is.";"CIFlashTransition.inputTime" = "De parametrische tijd van de overgang. Deze waarde bepaalt de overgang van begin (tijdwaarde 0) tot eind (tijdwaarde 1).";"CIModTransition.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect."; "CIModTransition.inputAngle" = "De hoek van het mod-holepatroon.";"CIModTransition.inputRadius" = "De radius van de niet-vervormde gaten in het patroon.";"CIModTransition.inputCompression" = "De mate van uitrekken die op het mod-holepatroon wordt toegepast. Gaten in het midden worden minder vervormd dan de gaten aan de rand van de afbeelding.";"CIModTransition.inputTime" = "De parametrische tijd van de overgang. Deze waarde bepaalt de overgang van begin (tijdwaarde 0) tot eind (tijdwaarde 1).";"CIPageCurlTransition.inputBacksideImage" = "De afbeelding die zichtbaar is op de achterkant van de bronafbeelding als de pagina wordt omgeslagen om de doelafbeelding zichtbaar te maken.";"CIPageCurlTransition.inputShadingImage" = "Een afbeelding die eruitziet als een bol met schaduwwerking ingesloten in een vierkante afbeelding.";"CIPageCurlTransition.inputExtent" = "De mate waarin het effect zich uitstrekt.";"CIPageCurlTransition.inputAngle" = "De hoek van de omkrullende pagina.";"CIPageCurlTransition.inputRadius" = "De radius van de krulling.";"CIPageCurlTransition.inputTime" = "De parametrische tijd van de overgang. Deze waarde bepaalt de overgang van begin (tijdwaarde 0) tot eind (tijdwaarde 1).";"CIRippleTransition.inputShadingImage" = "Een afbeelding die eruitziet als een bol met schaduwwerking ingesloten in een vierkante afbeelding.";"CIRippleTransition.inputCenter" = "De x- en de y-positie die worden gebruikt als het middelpunt van het effect."; "CIRippleTransition.inputExent" = "De mate waarin het effect zich uitstrekt.";"CIRippleTransition.inputWidth" = "De breedte van de rimpeling.";"CIRippleTransition.inputScale" = "Een waarde die bepaalt of de rimpeling als een ophoging (hogere waarde) of verlaging (lagere waarde) begint.";"CIRippleTransition.inputTime" = "De parametrische tijd van de overgang. Deze waarde bepaalt de overgang van begin (tijdwaarde 0) tot eind (tijdwaarde 1).";"CISwipeTransition.inputExtent" = "De mate waarin het effect zich uitstrekt.";"CISwipeTransition.inputColor" = "De kleur van de veegbeweging.";"CISwipeTransition.inputAngle" = "De hoek van de veegbeweging.";"CISwipeTransition.inputWidth" = "De breedte van de veegbeweging.";"CISwipeTransition.inputOpacity" = "De ondoorzichtigheid van de veegbeweging.";"CISwipeTransition.inputTime" = "De parametrische tijd van de overgang. Deze waarde bepaalt de overgang van begin (tijdwaarde 0) tot eind (tijdwaarde 1).";"CIAreaHistogram" = "Berekent een histogram voor het opgegeven gedeelte van een afbeelding en retourneert het resultaat in een eendimensionale afbeelding.";"CIAreaHistogram.inputExtent" = "Een rechthoek die bepaalt welk gedeelte van de afbeelding die u wilt verwerken.";"CIAreaHistogram.inputCount" = "Het aantal bins voor het histogram.";"CIAreaHistogram.inputImage" = "De afbeelding waarvan u het histogram wilt berekenen.";"CIAreaHistogram.inputScale" = "De schaalwaarde die moet worden gebruikt voor de histogramwaarden.";"CIAreaMaximum" = "Berekent de maximale componentwaarden voor het opgegeven gedeelte van een afbeelding en retourneert het resultaat in een pixel.";"CIAreaMaximum.inputExtent" = "Een rechthoek die bepaalt welk gedeelte van de afbeelding die u wilt verwerken.";"CIAreaMaximum.inputImage" = "De afbeelding die u wilt verwerken.";"CIAreaMinimum" = "Berekent de minimale componentwaarden voor het opgegeven gedeelte van een afbeelding en retourneert het resultaat in een pixel.";"CIAreaMinimum.inputExtent" = "Een rechthoek die bepaalt welk gedeelte van de afbeelding die u wilt verwerken.";"CIAreaMinimum.inputImage" = "De afbeelding die u wilt verwerken.";"CIAreaMaximumAlpha" = "Zoekt en retourneert de pixel met de maximale alfawaarde.";"CIAreaMaximumAlpha.inputExtent" = "Een rechthoek die bepaalt welk gedeelte van de afbeelding die u wilt verwerken.";"CIAreaMaximumAlpha.inputImage" = "De afbeelding die u wilt verwerken.";"CIAreaMinimumAlpha" = "Zoekt en retourneert de pixel met de minimale alfawaarde.";"CIAreaMinimumAlpha.inputExtent" = "Een rechthoek die bepaalt welk gedeelte van de afbeelding die u wilt verwerken.";"CIAreaMinimumAlpha.inputImage" = "De afbeelding die u wilt verwerken.";"CIAreaAverage" = "Berekent de gemiddelde kleur voor het opgegeven gedeelte van een afbeelding en retourneert het resultaat in een pixel.";"CIAreaAverage.inputExtent" = "Een rechthoek die bepaalt welk gedeelte van de afbeelding die u wilt verwerken.";"CIAreaAverage.inputImage" = "De afbeelding die u wilt verwerken.";"CIRowAverage" = "Berekent de gemiddelde kleur voor elke rij van het opgegeven gedeelte van een afbeelding en retourneert het resultaat in een eendimensionale afbeelding.";"CIRowAverage.inputExtent" = "Een rechthoek die bepaalt welk gedeelte van de afbeelding die u wilt verwerken.";"CIRowAverage.inputImage" = "De afbeelding die u wilt verwerken.";"CIColumnAverage" = "Berekent de gemiddelde kleur voor elke kolom van het opgegeven gedeelte van een afbeelding en retourneert het resultaat in een eendimensionale afbeelding.";"CIColumnAverage.inputExtent" = "Een rechthoek die bepaalt welk gedeelte van de afbeelding die u wilt verwerken.";"CIColumnAverage.inputImage" = "De afbeelding die u wilt verwerken.";"CIMinimumComponent" = "Zet een afbeelding om in grijstinten op basis van het minimum van de drie kleurcomponenten.";"CIMinimumComponent.inputExtent" = "Een rechthoek die bepaalt welk gedeelte van de afbeelding die u wilt verwerken.";"CIMinimumComponent.inputImage" = "De afbeelding die u wilt verwerken.";"CIMaximumComponent" = "Zet een afbeelding om in grijstinten op basis van het maximum van de drie kleurcomponenten.";"CIMaximumComponent.inputExtent" = "Een rechthoek die bepaalt welk gedeelte van de afbeelding die u wilt verwerken.";"CIMaximumComponent.inputImage" = "De afbeelding die u wilt verwerken.";